ngo/app/controllers/country_data_finals_controller.rb

  def index
    @country_data_finals = CountryDataFinal.all
---
SELECT "country_data_finals".* FROM "country_data_finals"

    def set_country_data_final
      @country_data_final = CountryDataFinal.find(params.expect(:id))
---
SELECT "country_data_finals".* FROM "country_data_finals" WHERE "country_data_finals"."id" = 1 LIMIT 1