ngo/app/controllers/queries_controller.rb

SELECT "country_data_finals".* FROM "country_data_finals" ORDER BY "country_data_finals"."mobilephones" DESC LIMIT 10
SELECT "country_data_finals".* FROM "country_data_finals" ORDER BY "country_data_finals"."population" DESC LIMIT 10
SELECT "country_data_finals".* FROM "country_data_finals" WHERE "country_data_finals"."lifeexpectancy" != 0.0 ORDER BY "country_data_finals"."lifeexpectancy" DESC LIMIT 10
SELECT "country_data_finals".* FROM "country_data_finals" WHERE "country_data_finals"."gdp" != 0.0 ORDER BY "country_data_finals"."gdp" DESC LIMIT 10
SELECT "country_data_finals".* FROM "country_data_finals" WHERE "country_data_finals"."mortalityunder5" != 0.0 ORDER BY "country_data_finals"."mortalityunder5" ASC LIMIT 10
---
  def results
    # Get the selection from params
    @selection = params[:selection]

    # Show results based on selection
    case @selection
    when "Q1"
      @title = "Mobile phones"
      @countries = CountryDataFinal.order(mobilephones: :desc).limit(10)
      @field = :mobilephones
    when "Q2"
      @title = "Population"
      @countries = CountryDataFinal.order(population: :desc).limit(10)
      @field = :population
    when "Q3"
      @title = "Life Expectancy"
      @countries = CountryDataFinal.where.not(lifeexpectancy: 0).order(lifeexpectancy: :desc).limit(10)
      @field = :lifeexpectancy
    when "Q4"
      @title = "GDP"
      @countries = CountryDataFinal.where.not(gdp: 0).order(gdp: :desc).limit(10)
      @field = :gdp
    when "Q5"
      @title = "Childhood Mortality"
      @countries = CountryDataFinal.where.not(mortalityunder5: 0).order(mortalityunder5: :asc).limit(10)